app/views/aquaria/edit.html.erb

    <p>
      <%= f.collection_check_boxes :fish_ids, Fish.all, :id, :name  do |b| %>
---
SELECT "fish".* FROM "fish"