app/views/aquaria/new.html.erb

SELECT "fish".* FROM "fish"
---
    <p><strong>Select Your Fish</strong></p>
    <p><%= f.collection_check_boxes :fish_ids, Fish.all, :id, :name  do |b| %>