app/views/aquaria/show.html.erb

  <ul>
    <% @aquarium.fishes.each do |fish| %>
---
SELECT "fish".* FROM "fish" INNER JOIN "aquaria_fish" ON "fish"."id" = "aquaria_fish"."fish_id" WHERE "aquaria_fish"."aquarium_id" = ?  [["aquarium_id", 4]]