app/views/users/show.html.erb

  <ul>
    <% @user.aquaria.each do |aquarium| %>
---
SELECT "aquaria".* FROM "aquaria" WHERE "aquaria"."user_id" = ?  [["user_id", 1]]