app/controllers/aquaria_controller.rb

SELECT "fish".* FROM "fish"
SELECT "users".* FROM "users"
---
    def new
      @aquarium = Aquarium.new
      @fishes = Fish.all
      @users = User.all