app/controllers/fishes_controller.rb

SELECT  "fish".* FROM "fish" WHERE "fish"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # These code snippets use an open-source library.
    @fish = Fish.find(params[:id])